app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "first_name", "last_name", "gender", "avatar", "dob", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save